# stepik8.8_zamena_chisel_massiva_mestami

В заданном массиве поменять местами первую и вторую половины.

Входные данные:
Первая строка число 
N
,
(
N
>
0
)
N,(N>0) -- длина массива (чётное число). Длина массива не более 100 элементов. Вторая строка 
N
N  натуральных чисел, записанных через пробел.

Выходные данные: 
Новый массив, в котором сначала записаны элементы с номерами 
k
+
1
,
k
+
2
,
…
,
N
k+1,k+2,…,N, а потом записаны элементы с номерами 
1
,
2
,
3
,
…
,
k
−
1
,
k
1,2,3,…,k−1,k, где 
k
k -- номер 
(
N
/
2
)
(N/2)-ого члена исходного массива. Между собой значения разделять одним пробелом.

Sample Input:
6
10 93 3 22 75 12
Sample Output:
22 75 12 10 93 3


#include <stdio.h>
#include <stdlib.h>
#include <math.h>
 
int main(){
    
    int n;
    int i;
    int array[100];
    int k;

    scanf("%d",&n);

    for (i=0; i<n; i++)
    {
        scanf("%d", &array[i]);
    }

    k = n/2;
  
    for (i=k; i<n; i++)
    printf("%d ", array[i]);

    for (i=0; i<k; i++)
    printf("%d ", array[i]);
    
  return 0;
   
}

